blackmagic-debug/blackmagic/src/target/stm32l0.c
/*
 * This file is part of the Black Magic Debug project.
 *
 * Copyright (C) 2014,2015 Marc Singer <elf@woollysoft.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/*
	Description
	-----------

	This is an implementation of the target-specific functions for the
	STM32L0x[1] and STM32L1x[2] families of ST Microelectronics MCUs,
	Cortex M0+ SOCs.  The NVM interface is substantially similar to the
	STM32L1x parts.  This module is written to better generalize the
	NVM interface and to provide more features.

	[1] ST Microelectronics Document RM0377 (DocID025942), "Reference
		manual for Ultra-low-power STM32L0x1 advanced ARM-based 32-bit
		MCUs," April 2014.
		(https://www.st.com/resource/en/reference_manual/rm0377-ultralowpower-stm32l0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf)

	[2] ST Microelectronics Document RM0038 (DocID15965, "..."Reference
		manual for STM32L100xx, STM32L151xx, STM32L152xx and STM32L162xx
		advanced ARM®-based 32-bit MCUs, " July 2014
		(https://www.st.com/resource/en/reference_manual/rm0038-stm32l100xx-stm32l151xx-stm32l152xx-and-stm32l162xx-advanced-armbased-32bit-mcus-stmicroelectronics.pdf)

	NOTES
	=====

	o Errors.  We probably should clear SR errors immediately after
		detecting them.  If we don't then we always must wait for the NVM
		module to complete the last operation before we can start another.

	o There are minor inconsistencies between the stm32l0 and the
		stm32l1 in when handling NVM operations.

	o On the STM32L1xx, PECR can only be changed when the NVM
		hardware is idle.  The STM32L0xx allows the PECR to be updated
		while an operation is in progress.
*/

#include "general.h"
#include "target.h"
#include "target_internal.h"
#include "cortexm.h"
#include "stm32_common.h"

#define STM32Lx_NVM_PECR(p)    ((p) + 0x04U)
#define STM32Lx_NVM_PEKEYR(p)  ((p) + 0x0cU)
#define STM32Lx_NVM_PRGKEYR(p) ((p) + 0x10U)
#define STM32Lx_NVM_OPTKEYR(p) ((p) + 0x14U)
#define STM32Lx_NVM_SR(p)      ((p) + 0x18U)
#define STM32Lx_NVM_OPTR(p)    ((p) + 0x1cU)

#define STM32L0_NVM_PHYS             UINT32_C(0x40022000)
#define STM32L0_NVM_OPT_SIZE         12U
#define STM32L0_NVM_EEPROM_CAT1_SIZE (1U * 512U)
#define STM32L0_NVM_EEPROM_CAT2_SIZE (1U * 1024U)
#define STM32L0_NVM_EEPROM_CAT3_SIZE (2U * 1024U)
#define STM32L0_NVM_EEPROM_CAT5_SIZE (6U * 1024U)

#define STM32L1_NVM_PHYS        UINT32_C(0x40023c00)
#define STM32L1_NVM_OPT_SIZE    32U
#define STM32L1_NVM_EEPROM_SIZE (16U * 1024U)

#define STM32Lx_NVM_OPT_PHYS    UINT32_C(0x1ff80000)
#define STM32Lx_NVM_EEPROM_PHYS UINT32_C(0x08080000)

#define STM32Lx_NVM_PEKEY1  UINT32_C(0x89abcdef)
#define STM32Lx_NVM_PEKEY2  UINT32_C(0x02030405)
#define STM32Lx_NVM_PRGKEY1 UINT32_C(0x8c9daebf)
#define STM32Lx_NVM_PRGKEY2 UINT32_C(0x13141516)
#define STM32Lx_NVM_OPTKEY1 UINT32_C(0xfbead9c8)
#define STM32Lx_NVM_OPTKEY2 UINT32_C(0x24252627)

#define STM32Lx_NVM_PECR_OBL_LAUNCH (1U << 18U)
#define STM32Lx_NVM_PECR_ERRIE      (1U << 17U)
#define STM32Lx_NVM_PECR_EOPIE      (1U << 16U)
#define STM32Lx_NVM_PECR_FPRG       (1U << 10U)
#define STM32Lx_NVM_PECR_ERASE      (1U << 9U)
#define STM32Lx_NVM_PECR_FIX        (1U << 8U) /* FTDW */
#define STM32Lx_NVM_PECR_DATA       (1U << 4U)
#define STM32Lx_NVM_PECR_PROG       (1U << 3U)
#define STM32Lx_NVM_PECR_OPTLOCK    (1U << 2U)
#define STM32Lx_NVM_PECR_PRGLOCK    (1U << 1U)
#define STM32Lx_NVM_PECR_PELOCK     (1U << 0U)

#define STM32Lx_NVM_SR_NOTZEROERR (1U << 16U)
#define STM32Lx_NVM_SR_SIZERR     (1U << 10U)
#define STM32Lx_NVM_SR_PGAERR     (1U << 9U)
#define STM32Lx_NVM_SR_WRPERR     (1U << 8U)
#define STM32Lx_NVM_SR_EOP        (1U << 1U)
#define STM32Lx_NVM_SR_BSY        (1U << 0U)
#define STM32Lx_NVM_SR_ERR_M \
	(STM32Lx_NVM_SR_WRPERR | STM32Lx_NVM_SR_PGAERR | STM32Lx_NVM_SR_SIZERR | STM32Lx_NVM_SR_NOTZEROERR)

#define STM32L0_NVM_OPTR_BOOT1    (1U << 31U)
#define STM32Lx_NVM_OPTR_WDG_SW   (1U << 20U)
#define STM32L0_NVM_OPTR_WPRMOD   (1U << 8U)
#define STM32Lx_NVM_OPTR_RDPROT_S 0U
#define STM32Lx_NVM_OPTR_RDPROT_M 0xffU
#define STM32Lx_NVM_OPTR_RDPROT_0 0xaaU
#define STM32Lx_NVM_OPTR_RDPROT_2 0xccU

#define STM32L1_NVM_OPTR_nBFB2      (1U << 23U)
#define STM32L1_NVM_OPTR_nRST_STDBY (1U << 22U)
#define STM32L1_NVM_OPTR_nRST_STOP  (1U << 21U)
#define STM32L1_NVM_OPTR_BOR_LEV_S  16U
#define STM32L1_NVM_OPTR_BOR_LEV_M  0xfU
#define STM32L1_NVM_OPTR_SPRMOD     (1U << 8U)

#define STM32L0_DBGMCU_IDCODE_PHYS UINT32_C(0x40015800)
#define STM32L1_DBGMCU_IDCODE_PHYS UINT32_C(0xe0042000)

static bool stm32lx_nvm_prog_erase(target_flash_s *flash, target_addr_t addr, size_t length);
static bool stm32lx_nvm_prog_write(target_flash_s *flash, target_addr_t dest, const void *src, size_t length);

static bool stm32lx_nvm_data_erase(target_flash_s *flash, target_addr_t addr, size_t length);
static bool stm32lx_nvm_data_write(target_flash_s *flash, target_addr_t dest, const void *src, size_t length);

static bool stm32lx_protected_attach(target_s *target);
static bool stm32lx_protected_mass_erase(target_s *target);
static bool stm32lx_mass_erase(target_s *target);

static bool stm32lx_cmd_option(target_s *target, int argc, const char **argv);
static bool stm32lx_cmd_eeprom(target_s *target, int argc, const char **argv);

static const command_s stm32lx_cmd_list[] = {
	{"option", stm32lx_cmd_option, "Manipulate option bytes"},
	{"eeprom", stm32lx_cmd_eeprom, "Manipulate EEPROM (NVM data) memory"},
	{NULL, NULL, NULL},
};

typedef struct stm32l_priv_s {
	char stm32l_variant[21];
} stm32l_priv_t;

static bool stm32lx_is_stm32l1(const target_s *const target)
{
	return target->part_id != 0x457U /* STM32L0xx Cat1 */ && target->part_id != 0x425U /* STM32L0xx Cat2 */ &&
		target->part_id != 0x417U /* STM32L0xx Cat3 */ && target->part_id != 0x447U /* STM32L0xx Cat5 */;
}

static uint32_t stm32lx_nvm_eeprom_size(const target_s *const target)
{
	switch (target->part_id) {
	case 0x457U: /* STM32L0xx Cat1 */
		return STM32L0_NVM_EEPROM_CAT1_SIZE;
	case 0x425U: /* STM32L0xx Cat2 */
		return STM32L0_NVM_EEPROM_CAT2_SIZE;
	case 0x417U: /* STM32L0xx Cat3 */
		return STM32L0_NVM_EEPROM_CAT3_SIZE;
	case 0x447U: /* STM32L0xx Cat5 */
		return STM32L0_NVM_EEPROM_CAT5_SIZE;
	default: /* STM32L1xx */
		return STM32L1_NVM_EEPROM_SIZE;
	}
}

