blackmagic-debug/blackmagic/src/target/stm32l0.c
static uint32_t stm32lx_nvm_phys(const target_s *const target)
{
	if (stm32lx_is_stm32l1(target))
		return STM32L1_NVM_PHYS;
	return STM32L0_NVM_PHYS;
}

static uint32_t stm32lx_nvm_option_size(const target_s *const target)
{
	if (stm32lx_is_stm32l1(target))
		return STM32L1_NVM_OPT_SIZE;
	return STM32L0_NVM_OPT_SIZE;
}

static void stm32l_add_flash(target_s *const target, const uint32_t addr, const size_t length, const size_t erasesize)
{
	target_flash_s *flash = calloc(1, sizeof(*flash));
	if (!flash) { /* calloc failed: heap exhaustion */
		DEBUG_ERROR("calloc: failed in %s\n", __func__);
		return;
	}

	flash->start = addr;
	flash->length = length;
	flash->blocksize = erasesize;
	flash->erase = stm32lx_nvm_prog_erase;
	flash->write = stm32lx_nvm_prog_write;
	flash->writesize = erasesize >> 1U;
	target_add_flash(target, flash);
}

static void stm32l_add_eeprom(target_s *const target, const uint32_t addr, const size_t length)
{
	target_flash_s *flash = calloc(1, sizeof(*flash));
	if (!flash) { /* calloc failed: heap exhaustion */
		DEBUG_ERROR("calloc: failed in %s\n", __func__);
		return;
	}

	flash->start = addr;
	flash->length = length;
	flash->blocksize = 4;
	flash->erase = stm32lx_nvm_data_erase;
	flash->write = stm32lx_nvm_data_write;
	target_add_flash(target, flash);
}

/* Probe for STM32L0xx and STM32L1xx parts. */
bool stm32l0_probe(target_s *const target)
{
	switch (target->part_id) {
	case 0x416U: /* CAT. 1 device */
	case 0x429U: /* CAT. 2 device */
	case 0x427U: /* CAT. 3 device */
	case 0x436U: /* CAT. 4 device */
	case 0x437U: /* CAT. 5 device  */
		target->driver = "STM32L1x";
		target_add_ram32(target, 0x20000000, 0x14000);
		stm32l_add_flash(target, 0x8000000, 0x80000, 0x100);
		//stm32l_add_eeprom(t, 0x8080000, 0x4000);
		target_add_commands(target, stm32lx_cmd_list, "STM32L1x");
		break;
	case 0x457U: /* STM32L0xx Cat1 */
	case 0x425U: /* STM32L0xx Cat2 */
	case 0x417U: /* STM32L0xx Cat3 */
	case 0x447U: /* STM32L0xx Cat5 */
		target->driver = "STM32L0x";
		target_add_ram32(target, 0x20000000, 0x5000);
		stm32l_add_flash(target, 0x8000000, 0x10000, 0x80);
		stm32l_add_flash(target, 0x8010000, 0x10000, 0x80);
		stm32l_add_flash(target, 0x8020000, 0x10000, 0x80);
		stm32l_add_eeprom(target, 0x8080000, 0x1800);
		target_add_commands(target, stm32lx_cmd_list, "STM32L0x");
		break;
	default:
		return false;
	}

	stm32l_priv_t *priv_storage = calloc(1, sizeof(*priv_storage));
	if (!priv_storage) {
		DEBUG_ERROR("calloc: failed in %s\n", __func__);
		return false;
	}
	target->target_storage = (void *)priv_storage;

	const uint32_t nvm = stm32lx_nvm_phys(target);
	const bool protected =
		(target_mem32_read32(target, STM32Lx_NVM_OPTR(nvm)) & STM32Lx_NVM_OPTR_RDPROT_M) != STM32Lx_NVM_OPTR_RDPROT_0;
	snprintf(priv_storage->stm32l_variant, sizeof(priv_storage->stm32l_variant), "%s%s", target->driver,
		protected ? " (protected)" : "");
	target->driver = priv_storage->stm32l_variant;

	if (protected) {
		target->attach = stm32lx_protected_attach;
		target->mass_erase = stm32lx_protected_mass_erase;
	} else
		target->mass_erase = stm32lx_mass_erase;

	return true;
}

/* Lock the NVM control registers preventing writes or erases. */
static void stm32lx_nvm_lock(target_s *const target, const uint32_t nvm)
{
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_PELOCK);
}

/*
 * Unlock the NVM control registers for modifying program or data flash.
 * Returns true if the unlock succeeds.
 */
static bool stm32lx_nvm_prog_data_unlock(target_s *const target, const uint32_t nvm)
{
	/* Always lock first because that's the only way to know that the unlock can succeed on the STM32L0's. */
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_PELOCK);
	target_mem32_write32(target, STM32Lx_NVM_PEKEYR(nvm), STM32Lx_NVM_PEKEY1);
	target_mem32_write32(target, STM32Lx_NVM_PEKEYR(nvm), STM32Lx_NVM_PEKEY2);
	target_mem32_write32(target, STM32Lx_NVM_PRGKEYR(nvm), STM32Lx_NVM_PRGKEY1);
	target_mem32_write32(target, STM32Lx_NVM_PRGKEYR(nvm), STM32Lx_NVM_PRGKEY2);

	return !(target_mem32_read32(target, STM32Lx_NVM_PECR(nvm)) & STM32Lx_NVM_PECR_PRGLOCK);
}

/*
 * Unlock the NVM control registers for modifying option bytes.
 * Returns true if the unlock succeeds.
 */
static bool stm32lx_nvm_opt_unlock(target_s *const target, const uint32_t nvm)
{
	/* Always lock first because that's the only way to know that the unlock can succeed on the STM32L0's. */
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_PELOCK);
	target_mem32_write32(target, STM32Lx_NVM_PEKEYR(nvm), STM32Lx_NVM_PEKEY1);
	target_mem32_write32(target, STM32Lx_NVM_PEKEYR(nvm), STM32Lx_NVM_PEKEY2);
	target_mem32_write32(target, STM32Lx_NVM_OPTKEYR(nvm), STM32Lx_NVM_OPTKEY1);
	target_mem32_write32(target, STM32Lx_NVM_OPTKEYR(nvm), STM32Lx_NVM_OPTKEY2);

	return !(target_mem32_read32(target, STM32Lx_NVM_PECR(nvm)) & STM32Lx_NVM_PECR_OPTLOCK);
}

static bool stm32lx_nvm_busy_wait(target_s *const target, const uint32_t nvm, platform_timeout_s *const timeout)
{
	while (target_mem32_read32(target, STM32Lx_NVM_SR(nvm)) & STM32Lx_NVM_SR_BSY) {
		if (target_check_error(target))
			return false;
		if (timeout)
			target_print_progress(timeout);
	}
	const uint32_t status = target_mem32_read32(target, STM32Lx_NVM_SR(nvm));
	return !target_check_error(target) && !(status & STM32Lx_NVM_SR_ERR_M);
}

/*
 * Erase a region of program flash using operations through the debug interface.
 * This is slower than stubbed versions (see NOTES).
 * The flash array is erased for all pages from addr to addr + length inclusive.
 * The NVM register base is automatically determined based on the target.
 */
static bool stm32lx_nvm_prog_erase(target_flash_s *const flash, const target_addr_t addr, const size_t length)
{
	target_s *const target = flash->t;
	const uint32_t nvm = stm32lx_nvm_phys(target);
	const bool full_erase = addr == flash->start && length == flash->length;
	if (!stm32lx_nvm_prog_data_unlock(target, nvm))
		return false;

	/* Flash page erase instruction */
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_ERASE | STM32Lx_NVM_PECR_PROG);

	const uint32_t pecr =
		target_mem32_read32(target, STM32Lx_NVM_PECR(nvm)) & (STM32Lx_NVM_PECR_PROG | STM32Lx_NVM_PECR_ERASE);
	if (pecr != (STM32Lx_NVM_PECR_PROG | STM32Lx_NVM_PECR_ERASE))
		return false;

