blackmagic-debug/blackmagic/src/target/stm32l0.c
	/*
	 * Clear errors.
	 * Note that this only works when we wait for the NVM block to complete the last operation.
	 */
	target_mem32_write32(target, STM32Lx_NVM_SR(nvm), STM32Lx_NVM_SR_ERR_M);

	platform_timeout_s timeout;
	platform_timeout_set(&timeout, 500);
	for (size_t offset = 0; offset < length; offset += flash->blocksize) {
		/* Trigger the erase by writing the first uint32_t of the page to 0 */
		target_mem32_write32(target, addr + offset, 0U);
		if (full_erase)
			target_print_progress(&timeout);
	}

	/* Disable further programming by locking PECR */
	stm32lx_nvm_lock(target, nvm);
	/* Wait for completion or an error */
	return stm32lx_nvm_busy_wait(target, nvm, full_erase ? &timeout : NULL);
}

/* Write to program flash using operations through the debug interface. */
static bool stm32lx_nvm_prog_write(
	target_flash_s *const flash, const target_addr_t dest, const void *const src, const size_t length)
{
	target_s *const target = flash->t;
	const uint32_t nvm = stm32lx_nvm_phys(target);

	if (!stm32lx_nvm_prog_data_unlock(target, nvm))
		return false;

	/* Wait for BSY to clear because we cannot write the PECR until the previous operation completes */
	if (!stm32lx_nvm_busy_wait(target, nvm, NULL))
		return false;

	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_PROG | STM32Lx_NVM_PECR_FPRG);
	target_mem32_write(target, dest, src, length);

	/* Disable further programming by locking PECR */
	stm32lx_nvm_lock(target, nvm);

	/* Wait for completion or an error */
	return stm32lx_nvm_busy_wait(target, nvm, NULL);
}

/*
 * Erase a region of data flash using operations through the debug interface.
 * The flash is erased for all pages from addr to addr + length, inclusive, on a word boundary.
 * The NVM register base is automatically determined based on the target.
 */
static bool stm32lx_nvm_data_erase(target_flash_s *const flash, const target_addr_t addr, const size_t length)
{
	target_s *const target = flash->t;
	const uint32_t nvm = stm32lx_nvm_phys(target);
	if (!stm32lx_nvm_prog_data_unlock(target, nvm))
		return false;

	/* Flash data erase instruction */
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_ERASE | STM32Lx_NVM_PECR_DATA);

	const uint32_t pecr =
		target_mem32_read32(target, STM32Lx_NVM_PECR(nvm)) & (STM32Lx_NVM_PECR_ERASE | STM32Lx_NVM_PECR_DATA);
	if (pecr != (STM32Lx_NVM_PECR_ERASE | STM32Lx_NVM_PECR_DATA))
		return false;

	const uint32_t aligned_addr = addr & ~3U;
	for (size_t offset = 0; offset < length; offset += flash->blocksize)
		/* Trigger the erase by writing the first uint32_t of the page to 0 */
		target_mem32_write32(target, aligned_addr + offset, 0U);

	/* Disable further programming by locking PECR */
	stm32lx_nvm_lock(target, nvm);

	/* Wait for completion or an error */
	return stm32lx_nvm_busy_wait(target, nvm, NULL);
}

/*
 * Write to data flash using operations through the debug interface.
 * The NVM register base is automatically determined based on the target.
 * Unaligned destination writes are supported (though unaligned sources are not).
 */
static bool stm32lx_nvm_data_write(
	target_flash_s *const flash, const target_addr_t dest, const void *const src, const size_t length)
{
	target_s *const target = flash->t;
	const uint32_t nvm = stm32lx_nvm_phys(target);
	const bool is_stm32l1 = stm32lx_is_stm32l1(target);

	if (!stm32lx_nvm_prog_data_unlock(target, nvm))
		return false;

	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), is_stm32l1 ? 0 : STM32Lx_NVM_PECR_DATA);

	/* Sling data to the target one uint32_t at a time */
	const uint32_t *const data = (const uint32_t *)src;
	for (size_t offset = 0; offset < length; offset += 4U) {
		/* XXX: Why is this not able to use target_mem_write()? */
		if (target_mem32_write32(target, dest + offset, data[offset]))
			return false;
	}

	/* Disable further programming by locking PECR */
	stm32lx_nvm_lock(target, nvm);
	/* Wait for completion or an error */
	return stm32lx_nvm_busy_wait(target, nvm, NULL);
}

static bool stm32lx_protected_attach(target_s *const target)
{
	tc_printf(target, "Attached in protected mode, please issue 'monitor erase_mass' to regain chip access\n");
	target->attach = cortexm_attach;
	return true;
}

static bool stm32lx_protected_mass_erase(target_s *const target)
{
	const uint32_t nvm = stm32lx_nvm_phys(target);
	if (!stm32lx_nvm_opt_unlock(target, nvm))
		return false;

	target_mem32_write32(target, STM32Lx_NVM_OPT_PHYS, 0xffff0000U);
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_OBL_LAUNCH);
	target_mem32_write32(target, STM32Lx_NVM_OPT_PHYS, 0xff5500aaU);
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_OBL_LAUNCH);

	platform_timeout_s timeout;
	platform_timeout_set(&timeout, 500);

	while (target_mem32_read32(target, STM32Lx_NVM_SR(nvm)) & STM32Lx_NVM_SR_BSY)
		target_print_progress(&timeout);

	/* Disable further programming by locking PECR */
	stm32lx_nvm_lock(target, nvm);
	return true;
}

static bool stm32lx_mass_erase(target_s *const target)
{
	for (target_flash_s *flash = target->flash; flash; flash = flash->next) {
		const int result = stm32lx_nvm_prog_erase(flash, flash->start, flash->length);
		if (result != 0)
			return false;
	}
	return true;
}

/*
 * Write one option word.
 * The address is the physical address of the word and the value is a complete word value.
 * The caller is responsible for making sure that the value satisfies the proper
 * format where the upper 16 bits are the 1s complement of the lower 16 bits.
 * The function returns when the operation is complete.
 * The return value is true if the write succeeded.
 */
static bool stm32lx_option_write(target_s *const target, const uint32_t address, const uint32_t value)
{
	const uint32_t nvm = stm32lx_nvm_phys(target);

	/* Erase and program option in one go. */
	target_mem32_write32(target, STM32Lx_NVM_PECR(nvm), STM32Lx_NVM_PECR_FIX);
	target_mem32_write32(target, address, value);

	/* Wait for completion or an error */
	return stm32lx_nvm_busy_wait(target, nvm, NULL);
}

